[
  {
    "title" : "The LEGO Architect",
    "smallTitle" : "Hardcover – September 25, 2015",
    "link" : "http://www.amazon.com/gp/product/1593276133/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=1593276133&linkCode=as2&tag=legospriccomp-20&linkId=QW2MTGQJ4TWZHRNG",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1593276133&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "pre oder $16.27",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=1593276133",
    "desc" : "Travel through the history of architecture in The LEGO Architect. You'll learn about styles like Art Deco, Modernism, and High-Tech, and find inspiration in galleries of LEGO models. Then take your turn building 12 models in a variety of styles. Snap together some bricks and learn architecture the fun way!"
  },
  {
    "title" : "Star Wars Millennium Falcon 75105",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WI0PJE2/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WI0PJE2&linkCode=as2&tag=legospriccomp-20&linkId=33EEMLAS4QW2CN3B",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WI0PJE2&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$149.99",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WI0PJE2",
    "desc" : "Travel the galaxy with Han Solo, Chewbacca and others in the iconic Millennium Falcon! Aim for the stars with the Millennium Falcon featuring streamlined design, detachable cockpit, spring-loaded shooter, holochess board and lots more. One of the most iconic starships of the Star Wars saga is back, and it's leaner and meaner than ever before! As featured in exciting scenes from Star Wars: The Force Awakens, this latest LEGO version of the Millennium Falcon is crammed with new and updated external features, including an even more streamlined and detailed design, detachable cockpit with space for 2 minifigures, rotating top and bottom laser turrets with hatch and space for a minifigure, dual spring-loaded shooters, sensor dish, ramp and an entrance hatch. Open up the hull plates to reveal even more great new and updated details inside, including the main hold with seating area and holochess board, more detailed hyperdrive, secret compartment, extra boxes and cables, and storage for spring-loaded shooter ammo. And of course no LEGO Millennium Falcon model would be complete without Han Solo and Chewbacca, as well as other great characters from Star Wars: The Force Awakens. Activate the hyperdrive and set course for LEGO Star Wars fun! Includes 6 minifigures with assorted weapons: Rey, Finn, Han Solo, Chewbacca, Tasu Leech and a Kanjiklub Gang Member, plus a BB-8 Astromech Droid. Exterior features streamlined and detailed design, detachable cockpit with space for 2 minifigures, rotating top and bottom laser turrets with hatch and space for a minifigure, dual spring-loaded shooters, sensor dish, ramp, entrance hatch and opening hull plates. Detailed interior includes a more detailed hyperdrive, holochess board, secret compartment, extra boxes and cables, and storage for spring-loaded shooter ammo. Weapons include pistols, blaster, gang pistol, gang rifle and a bowcaster. Lift the hull plates to check out detail. Detach the cockpit. Fire the dual spring-loaded shooters."
  },
  {
    "title" : "Kylo Ren's Command Shuttle 75104",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WHZ80HG/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WHZ80HG&linkCode=as2&tag=legospriccomp-20&linkId=22GTQMSDDUCOO4OX",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WHZ80HG&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$119.00 (You Save:	$0.99)",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WHZ80HG",
    "desc" : "Enter the battle with Kylo Ren's Command Shuttle! Go in search of the enemy with Kylo Ren's Command Shuttle with storage bays, spring-loaded shooters, amazing extending wing function and more. Enter the battle with Kylo Ren's personal Command Shuttle! This fantastic, highly detailed starship has loads of features, including opening front, rear and bottom storage bays; wing-mounted, spring-loaded shooters and detachable weapon racks. And when you're ready for even more action, activate the amazing extending wing function! It's time to hunt down the enemy and play out your own great scenes from Star Wars: The Force Awakens! Includes 6 minifigures with assorted weapons and accessories: Kylo Ren, General Hux, First Order Officer, 2 First Order Crew and a First Order Stormtrooper Officer. Features opening front, rear and bottom storage bays; wing-mounted, spring-loaded shooters and detachable weapon racks, and amazing extending wing function. Weapons include 2 blaster pistols, blaster and Kylo Ren's Lightsaber. Accessories include 4 helmets and an electrobinoculars element. Activate the amazing extending wing function!"
  },
  {
    "title" : "Kylo Ren's Command Shuttle 75104",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WHYTSS2/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WHYTSS2&linkCode=as2&tag=legospriccomp-20&linkId=PWGDRSUGFNLFRNZL",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WHYTSS2&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$89.00 (You Save:	$0.99)",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WHZ80HG",
    "desc" : "Deliver troops to the battle with the super-tough First Order Transporter! Battle with the First Order Transporter with spring-loaded shooters, stud shooter, opening ramp, 7 minifigures, removable top and more. Lower the ramp, load the troopers and get ready to transport them into battle! This heavily armored First Order Transporter is packed with cool features, like dual spring-loaded shooters, top-mounted dual-stud shooter and hatch with space for a minifigure, pilot cabin with opening hatch and space for 4 minifigures in the hold, big engines at the rear, and hidden, transparent wheels for a cool 'hover' look. You can also remove the top section for easy access. Get ready to recreate incredible battle scenes from Star Wars: The Force Awakens! Includes 7 minifigures with assorted weapons and accessories: 2 Resistance Soldiers, 2 First Order Flametroopers, 2 First Order Stormtroopers and Captain Phasma. Features dual spring-loaded shooters, top-mounted stud shooter, pilot cabin with opening hatch and space for a minifigure, hold with space for 4 minifigures, big engines at the rear, removable top section, and hidden, transparent wheels for a 'hovering' look. weapons include 2 blasters, silver-look blaster, titanium-look blaster and 2 flame throwers."
  },
  {
    "title" : "Poe's X-Wing Fighter 75102",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WHZ6WOO/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WHZ6WOO&linkCode=as2&tag=legospriccomp-20&linkId=QND2O64PSTABLCI2",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WHZ6WOO&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$79.00 (You Save:	$0.99)",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WHZ6WOO",
    "desc" : "Go on daring missions with Poe's X-Wing Fighter! Board Poe's X-Wing Fighter with spring-loaded shooters, stud shooters, retractable landing gear, opening wings, loader, access ladder and more. Battle the forces of the First Order with Poe's X-Wing Fighter. This customized starfighter is packed with features, like the 4 spring-loaded shooters, 2 stud shooters, retractable landing gear, opening wings, opening cockpit with space for a minifigure and space behind for the BB-8 Astromech Droid. There's even a loader with weapon rack, extra missiles and ammunition, and a seat for a minifigure. So climb the access ladder, strap in and get ready to recreate your own great scenes from Star Wars: The Force Awakens! Includes 3 minifigures with assorted weapons and accessories: Poe Dameron, Resistance ground crew and a Resistance X-Wing Pilot, plus a BB-8 Astromech Droid. Features Poe's X-Wing Fighter, loader and an access ladder."
  },
  {
    "title" : "TIE Fighter 75101",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WHYTQXE/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WHYTQXE&linkCode=as2&tag=legospriccomp-20&linkId=ZLHLSVVLIYU2B5IL",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WHYTQXE&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$69.00 (You Save:	$0.99)",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WHYTQXE",
    "desc" : "Intercept and destroy with the battle-ready First Order Special Forces TIE fighter! Blast the enemy with the First Order Special Forces TIE fighter featuring 2-minifigure opening cockpit, 2 spring-loaded shooters and more. Intercept the enemy with the impressive First Order Special Forces TIE fighter. The unmistakable shape of this iconic starfighter signifies the military might of the First Order, and features a 2-minifigure cockpit that opens from the top and bottom, 2 spring-loaded shooters and a rotating antenna for homing in on enemy starships. With this great model, you can recreate the epic excitement of Star Wars: The Force Awakens. Includes 4 minifigures with assorted weapons and accessories: 2 First Order TIE Fighter Pilots, First Order Officer and a First Order Crew. Features iconic design, 2-minifigure opening cockpit, 2 spring-loaded shooters and a rotating antenna, Weapons include 3 blaster pistols. Accessories include 2 helmets,"
  },
  {
    "title" : "TIE Fighter 75101",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WI0SS7M/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WI0SS7M&linkCode=as2&tag=legospriccomp-20&linkId=EA6L65N4CZ44Q4TS",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WI0SS7M&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$39.92 (You Save:	$0.07)",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WI0SS7M",
    "desc" : "Send in the rapid response First Order Snowspeeder! Drive back the enemy with the First Order Snowspeeder featuring three-man crew, storage, stud shooter, rapid-fire shooters, hidden wheels and more. Call in weaponized support with the First Order Snowspeeder! With a crew of three, this rapid response vehicle features a forward storage compartment, fixed stud shooter in the cockpit, two rapid-fire stud shooters built into the engines and transparent wheels hidden out of site for a true 'hover' look. Now you can recreate your own great scenes from Star Wars: The Force Awakens. Includes 3 minifigures with assorted weapons: 2 First Order Snowtroopers and a First Order Snowtrooper Officer. Features storage compartment, cockpit-mounted stud shooter, rapid-fire shooters and hidden wheels. Weapons include 2 blasters and a modified blaster."
  },
  {
    "title" : "Rey's Speeder 75099",
    "smallTitle" : "LEGO Star Wars",
    "link" : "http://www.amazon.com/gp/product/B00WI0QCAM/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00WI0QCAM&linkCode=as2&tag=legospriccomp-20&linkId=6AAAETT7HVJACHJZ",
    "img" : "http://ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B00WI0QCAM&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=legospriccomp-20",
    "price" : "$19.87 (You Save:	$0.12)",
    "uvImage" : "http://ir-na.amazon-adsystem.com/e/ir?t=legospriccomp-20&l=as2&o=1&a=B00WI0QCAM",
    "desc" : "Speed into action on Rey's Speeder! Collect Rey's Speeder with dual stud shooters, opening storage hatch and side-mounted bag, blaster, buzzsaw, electrobinoculars and more. Hover into action on Rey's Speeder! This cool landspeeder has everything Rey needs for scouting the surface of a desert planet, including dual stud shooters, opening storage hatch and side-mounted bag, blaster, buzzsaw and electrobinoculars. There's also a detachable sled with space for a minifigure when Rey must make a quick escape down the desert dunes! Recreate your own fantastic scenes from Star Wars: The Force Awakens. Includes 2 minifigures: Rey and Unkar's Thug with a crowbar."
  }
]
